In [1]:
import numpy as np
import pandas as pd

In [11]:
df=pd.read_csv('data.csv')

In [12]:
df.columns

Index(['Institute', 'Academic Program Name', 'Quota', 'Seat Type', 'Gender',
       'Opening Rank', 'Closing Rank', 'Year', 'Round'],
      dtype='object')

In [13]:
df.dtypes

Institute                object
Academic Program Name    object
Quota                    object
Seat Type                object
Gender                   object
Opening Rank             object
Closing Rank             object
Year                      int64
Round                     int64
dtype: object

In [14]:
df.describe()

               Year         Round
count  94611.000000  94611.000000
mean    2019.509846      3.698280
std        1.830399      1.850572
min     2016.000000      1.000000
25%     2018.000000      2.000000
50%     2020.000000      4.000000
75%     2021.000000      5.000000
max     2022.000000      7.000000

In [15]:
df=df[[ 'Institute', 'Academic Program Name', 'Quota',
       'Seat Type', 'Gender', 'Opening Rank', 'Closing Rank', 'Year', 'Round']].copy()

In [16]:
df[['Quota']]

      Quota
0        AI
1        AI
2        AI
3        AI
4        AI
...     ...
94606    AI
94607    AI
94608    AI
94609    AI
94610   NaN

[94611 rows x 1 columns]

In [17]:
df=df.drop('Quota',axis=1)

In [18]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,NaN,3533,5947,2016,1
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,NaN,1829,2213,2016,1
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,NaN,663,1023,2016,1
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,NaN,331,357,2016,1
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,NaN,5408,6561,2016,1

In [19]:
df=df.assign(Preparatory=False)

In [21]:
df['Opening Rank'].str.contains('P').sum()

5428

In [23]:
df.loc[df['Opening Rank'].str.contains('P', na=False), 'Preparatory'] = True

In [24]:
df['Opening Rank']=df['Opening Rank'].str.replace('P',(''))

In [25]:
df['Closing Rank']=df['Closing Rank'].str.replace('P',(''))

In [35]:
df['Closing Rank'] = pd.to_numeric(df['Closing Rank'], errors='coerce')

In [37]:
df = df.dropna(subset=['Closing Rank'])

In [38]:
df['Closing Rank'] = df['Closing Rank'].astype(np.int64)

In [39]:
df['Opening Rank'] = pd.to_numeric(df['Opening Rank'], errors='coerce')

In [40]:
df = df.dropna(subset=['Opening Rank'])

In [41]:
df['Opening Rank'] = df['Opening Rank'].astype(np.int64)

In [42]:
df.dtypes

Institute                object
Academic Program Name    object
Seat Type                object
Gender                   object
Opening Rank              int64
Closing Rank              int64
Year                      int64
Round                     int64
Preparatory                bool
Institute_type           object
dtype: object

In [43]:
df=df.assign(Institute_type='IIT')

In [44]:
df.to_csv('final.csv')

In [45]:
df.head()

,Institute,Academic Program Name,Seat Type,Gender,Opening Rank,Closing Rank,Year,Round,Preparatory,Institute_type
0,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OPEN,NaN,3533,5947,2016,1,False,IIT
1,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",OBC-NCL,NaN,1829,2213,2016,1,False,IIT
2,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",SC,NaN,663,1023,2016,1,False,IIT
3,Indian Institute of Technology Bhubaneswar,"Civil Engineering (4 Years, Bachelor of Techno...",ST,NaN,331,357,2016,1,False,IIT
4,Indian Institute of Technology Bhubaneswar,Civil Engineering and M. Tech. in Structural E...,OPEN,NaN,5408,6561,2016,1,False,IIT